app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `username` = 'test'
 LIMIT 1
---
    public function authenticate()
    {
        $model = new UserModel();
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $user = $model->where('username', $username)->first();