app/Controllers/Dashboard.php

    public function index()
    {
        $data = [
            'totalUsers' => $this->userModel->countAll(),
            'totalProducts' => $this->productModel->countAll(),
            'recentUsers' => $this->userModel->orderBy('created_at', 'DESC')->limit(5)->findAll(),
            'recentProducts' => $this->productModel->orderBy('created_at', 'DESC')->limit(5)->findAll()
        ];
---
SELECT *
FROM `products`
ORDER BY `created_at` DESC
 LIMIT 5
SELECT *
FROM `users`
ORDER BY `created_at` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `products`