app/Controllers/ProductController.php

    public function index()
    {
        $data['products'] = $this->productModel->findAll();
---
SELECT *
FROM `products`

    public function edit($id)
    {
        $data['product'] = $this->productModel->find($id);
---
SELECT *
FROM `products`
WHERE `products`.`id` = '1'

    public function delete($id)
    {
        $this->productModel->delete($id);
---
DELETE FROM `products`
WHERE `id` IN ('3')