app/Controllers/UserController.php

    public function index()
    {
        $data['users'] = $this->userModel->findAll();
---
SELECT *
FROM `users`

    public function edit($id)
    {
        $data['user'] = $this->userModel->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '6'

    public function delete($id)
    {
        $this->userModel->delete($id);
---
DELETE FROM `users`
WHERE `id` IN ('9')